In [7]:
import pandas as pd

In [12]:
#데이터 프레임 객체 생성
df1 = pd.DataFrame(
    {"id" : [100,102, 107],
    "math" : [99, 100, 97],
    "english" : [95, 92, 94]
    }
)
print(df1) 

df2 = pd.DataFrame(
    [
        [100, 99, 95],
        [102, 100, 92],
        [107, 97, 94]
    ] , columns = ["id", "math", "english"]
      , index=[1,2,3]
)
print(df2)

    id  math  english
0  100    99       95
1  102   100       92
2  107    97       94
    id  math  english
1  100    99       95
2  102   100       92
3  107    97       94

In [16]:
#melt : wide form -> long form
df3 = pd.melt(df2)
print(df3)

  variable  value
0       id    100
1       id    102
2       id    107
3     math     99
4     math    100
5     math     97
6  english     95
7  english     92
8  english     94

In [ ]:
df3 = pd.melt(df2).rename(columns={"variable":"var","value":"val"})
print(df3)

       var  val
0       id  100
1       id  102
2       id  107
3     math   99
4     math  100
5     math   97
6  english   95
7  english   92
8  english   94

In [18]:
df3 = pd.melt(df2).rename(columns={"variable":"var","value":"val"}).query("val > 95")
print(df3)

    var  val
0    id  100
1    id  102
2    id  107
3  math   99
4  math  100
5  math   97

In [ ]:
#pivot : long form -> wide form
df = pd.DataFrame({
    'date' : ['2025-09-13', '2025-09-13', '2025-09-14', '2025-09-15'], #결측치 발생
    'city' : ['Seoul', 'Incheon', 'Seoul', 'Incheon'],
    'temp' : [25,24,27,24]
})
print(df)
print()

df1 = df.pivot(index='date', columns='city', values='temp')
print(df1)

         date     city  temp
0  2025-09-13    Seoul    25
1  2025-09-13  Incheon    24
2  2025-09-14    Seoul    27
3  2025-09-15  Incheon    24

city        Incheon  Seoul
date
2025-09-13     24.0   25.0
2025-09-14      NaN   27.0
2025-09-15     24.0    NaN

In [33]:
import seaborn as sns

print(sns.get_dataset_names())

df = sns.load_dataset('titanic')
print(df)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [ ]:
df = sns.load_dataset('mpg')
print(df)

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0    3504          12.0
1    15.0          8         350.0       165.0    3693          11.5
2    18.0          8         318.0       150.0    3436          11.0
3    16.0          8         304.0       150.0    3433          12.0
4    17.0          8         302.0       140.0    3449          10.5
..    ...        ...           ...         ...     ...           ...
393  27.0          4         140.0        86.0    2790          15.6
394  44.0          4          97.0        52.0    2130          24.6
395  32.0          4         135.0        84.0    2295          11.6
396  28.0          4         120.0        79.0    2625          18.6
397  31.0          4         119.0        82.0    2720          19.4

     model_year  origin                       name
0            70     usa  chevrolet chevelle malibu
1            70     usa          buick skylark 320
2            70     usa         plymouth satellite
3            70     usa              amc rebel sst
4            70     usa                ford torino
..          ...     ...                        ...
393          82     usa            ford mustang gl
394          82  europe                  vw pickup
395          82     usa              dodge rampage
396          82     usa                ford ranger
397          82     usa                 chevy s-10

[398 rows x 9 columns]

In [40]:
print(df[df.age > 70])
print(df[df.sample(!=7)])
print(df.nsmallest(4,'age'))

SyntaxError: invalid syntax (1680740879.py, line 2)